[
    {
        "icon_dark": "../images/experience/road_dark.png",
        "icon_light": "../images/experience/road_dark.png",
        "institution": "Road",
        "title": "Software Engineer",
        "website": "https://www.road.io/",
        "location": "Amsterdam, Netherlands",
        "period": "01/2024 - Present",
        "responsibilities": [
            "Designed and implemented an event-driven system using Go, gRPC, Redpanda, and GCP to enable anonymous payments for EV charging sessions in compliance with AFIR regulations.",
            "Implemented a redesigned account creation flow using TypeScript, integrating Mixpanel for tracking user actions."
        ]
    },
    {
        "icon_dark": "../images/experience/olx_dark.png",
        "icon_light": "../images/experience/olx_light.png",
        "institution": "OLX",
        "title": "Software Engineer",
        "website": "https://www.olxgroup.com/",
        "location": "Lisbon, Portugal",
        "period": "06/2021 - 12/2023",
        "responsibilities": [
            "Designed and implemented RESTful microservices using Go and AWS to enable high-volume listers to post inventory and handle the monetization of large amounts of adverts across multiple countries.",
            "Deployed and managed services on AWS using Kubernetes, Docker, Terraform, and ArgoCD.",
            "Implemented monitoring and alerts using New Relic, and set up log management using Kibana.",
            "Conducted performance tests on advert ingestion APIs using Python.",
            "Maintained a legacy monolith in PHP.",
            "Mentored junior and trainee team members."
        ]
    },
    {
        "icon_dark": "../images/experience/blaua_ai.png",
        "icon_light": "../images/experience/blaua_ai.png",
        "institution": "Blaua",
        "title": "Software Engineer",
        "website": "https://www.linkedin.com/company/blaua/",
        "period": "03/2021 - 04/2021",
        "responsibilities": [
            "Optimized the conversations page with efficient SQL querying, reducing loading time from over 10 seconds to less than 1 second.",
            "Implemented conversation filtering, export to CSV, and live chat functionalities.",
            "Used AWS S3 buckets to store chatbot profile pictures uploaded by businesses."
        ]
    },
    {
        "icon_dark": "../images/experience/deloitte_dark.png",
        "icon_light": "../images/experience/deloitte_light.png",
        "institution": "Deloitte",
        "title": "Summer Intern",
        "website": "https://www2.deloitte.com/pt/pt.html",
        "location": "Lisbon, Portugal",
        "period": "06/2018 - 07/2018",
        "responsibilities": [
            "Joined a team in the Risk Advisory sector, where I worked with SAS Data Integration Studio to optimize processes for a banking client by using efficient SQL queries.",
            "Was recognized by Deloitte partners for making the best presentation on a challenge between all interns, receiving a Deloitte Certificate of Achievement."
        ]
    }
]